#  таблица Дроны
#  максимальная высота полета
#  максимальная скорость полета
#  максимальное время полета
#  ID
#  S/N
#  модель
#  производитель
#  дата покупки
#  налет в моточасах
#  версия ПО
#  статус (активен/в ремонте/т.д)


#  таблица статус дронов
#  ID
#  название статусов


#  таблица статус дронов
#  ID дрона
#  статус ID
#  миссия ID
#  оператор ID
#  дата/время изменения статуса
#  уровень заряда батареи
#  координаты дрона
#  геолокация дрона
#  находится ли в полете


#  техническое обслуживание
#  ID дрона
#  дата последнего ТО
#  описание работ


#  таблица миссии дронов
#  описание миссии
#  дата начала миссии
#  дата окончания миссии
#  статус миссии (активна/завершена/в процессе/т.д.)
#  ID дрона
#  ID статуса миссии
#  название


#  таблица операторов
#  ID оператора
#  имя
#  контакты
#  комментарий



